---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ReplaceSpareSpaceOnSwitchBoard
source: html/d14d13e8-440c-e214-f4d3-ba61b8c80bbe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ReplaceSpareSpaceOnSwitchBoard Property

Need to replace spare or space on switchboard.

## Syntax (C#)
```csharp
public static FailureDefinitionId ReplaceSpareSpaceOnSwitchBoard { get; }
```